cask_args appdir: "~/Applications", require_sha: true

brew "agent-browser"
brew "awscli"
brew "bat"
brew "deno"
brew "difftastic"
brew "direnv"
brew "dive"           # Analyze Docker images
brew "duf"
brew "eza"
brew "fd"
brew "fortune"
brew "fzf"
brew "gh"
brew "git"
brew "go-task"
brew "helm"
brew "helmfile"
brew "hostess"
brew "htop"
brew "iredis"
brew "jq"
brew "kdash-rs/kdash/kdash"
brew "krew"
brew "kubectx"
brew "kubefwd"
brew "kubernetes-cli"
brew "lazydocker"
brew "lolcat"         # Make console output rainbow colored
brew "mtr"
brew "neovim"
brew "opencode"
brew "openjdk"
brew "pipx"
brew "prettier"
brew "ripgrep"
brew "rsync"
brew "sqlite"
brew "starship"
brew "wget"
brew "yq"
brew "zoxide"
brew "zsh-autocomplete"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

cask "cmux"
cask "font-fira-code-nerd-font"
cask "ghostty"
cask "keycastr"
cask "ngrok"
cask "orbstack"

if File.exist?(File.expand_path("~/.Brewfile.local"))
  instance_eval(File.read(File.expand_path("~/.Brewfile.local")))
end
