cask_args appdir: "~/Applications", require_sha: true

brew "git"
brew "hostess"
brew "htop"
brew "iredis"
brew "mise"
brew "mtr"
brew "openjdk"
brew "rsync"
brew "sqlite"
brew "wget"
brew "zsh-autocomplete"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

cask "altair-graphql-client"
cask "bitwarden"
cask "brave-browser"
cask "clocker", args: { appdir: "/Applications" } # This app needs to be in /Applications to work properly
cask "cmux"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "fork"
cask "google-chrome", args: { require_sha: false }
cask "keycastr"
cask "lm-studio", args: { appdir: "/Applications" } # This app needs to be in /Applications to work properly
cask "ngrok"
cask "obsidian"
cask "orbstack"
cask "raycast"
cask "redis-insight"
cask "visual-studio-code"
cask "voiceink"

if File.exist?(File.expand_path("~/.Brewfile.local"))
  instance_eval(File.read(File.expand_path("~/.Brewfile.local")))
end
