cask_args appdir: "~/Applications", require_sha: true

brew "awscli"
brew "bat"
brew "deno"
brew "difftastic"
brew "dive"           # Analyze Docker images
brew "duf"
brew "eza"
brew "fd"
brew "fortune"
brew "fzf"
brew "gh"
brew "git"
brew "go-task"
brew "hostess"
brew "htop"
brew "iredis"
brew "jq"
brew "jwt-cli"
brew "k3d"
brew "kdash-rs/kdash/kdash"
brew "kubefwd"
brew "lazydocker"
brew "lolcat"         # Make console output rainbow colored
brew "mise"
brew "mtr"
brew "neovim"
brew "openjdk"
brew "pipx"
brew "ripgrep"
brew "rsync"
brew "sqlite"
brew "starship"
brew "wget"
brew "yq"
brew "zoxide"
brew "zsh-autocomplete"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

cask "altair-graphql-client"
cask "bitwarden"
cask "brave-browser"
cask "clocker", args: { appdir: "/Applications" } # This app needs to be in /Applications to work properly
cask "cmux"
cask "copilot-cli"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "fork"
cask "ghostty"
cask "google-chrome", args: { require_sha: false }
cask "keycastr"
cask "lm-studio"
cask "ngrok"
cask "obsidian"
cask "orbstack"
cask "raycast"
cask "redis-insight"
cask "visual-studio-code"
cask "voiceink"

if File.exist?(File.expand_path("~/.Brewfile.local"))
  instance_eval(File.read(File.expand_path("~/.Brewfile.local")))
end
